<a href="https://colab.research.google.com/github/whdo787/database/blob/main/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db")

In [7]:
r_set=my_conn.execute('''CREATE TABLE student(
    id int NOT NULL,
    name varchar(64),
    class varchar(32),
    mark integer,
    sex varchar(32),
    PRIMARY KEY (id)
);''')

In [8]:
r_set = my_conn.execute('''INSERT INTO student (id, name, class, mark, sex) VALUES
(1, 'John Deo', 'Four', 75, 'female'),
(2, 'Max Ruin', 'Three', 85, 'male'),
(3, 'Arnold', 'Three', 55, 'male'),
(4, 'Krish Star', 'Four', 60, 'female'),
(5, 'John Mike', 'Four', 60, 'female'),
(6, 'Alex John', 'Four', 55, 'male'),
(7, 'My John Rob', 'Five', 78, 'male'),
(8, 'Asruid', 'Five', 85, 'male'),
(9, 'Tes Qry', 'Six', 78, 'male'),
(10, 'Big John', 'Four', 55, 'female'),
(11, 'Ronald', 'Six', 89, 'female'),
(27, 'Big Nose', 'Three', 81, 'female'),
(28, 'Rojj Base', 'Seven', 86, 'female'),
(29, 'Tess Played', 'Seven', 55, 'male'),
(30, 'Reppy Red', 'Six', 79, 'female'),
(31, 'Marry Toeey', 'Four', 88, 'male'),
(32, 'Binn Rott', 'Seven', 90, 'female'),
(33, 'Kenn Rein', 'Six', 96, 'female'),
(34, 'Gain Toe', 'Seven', 69, 'male'),
(35, 'Rows Noump', 'Six', 88, 'female');
''')

In [21]:
with open("student_tables.sql", "r") as file:
  query = file.read()
  my_conn.execute(query)
r_set=my_conn.execute("SELECT name from sqlite_master WHERE type ='table'")
for row in r_set:
  print(row)

('student',)

In [22]:
with open("student_insert.sql","r") as file:
# r means read
  query =file.read()
  my_conn.execute(query)
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [23]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark = mark+1"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else :
  print("No of records updated :",r_set.rowcount)

No of records updated : 20

In [24]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark = mark+1 WHERE id = 7"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else :
  print("No of records updated :",r_set.rowcount)

No of records updated : 1

In [25]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [27]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET class ='Four' WHERE class = 'Three'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else :
  print("No of records updated :",r_set.rowcount)
  # rowcount : 영향받은 행 수 반환

No of records updated : 3

In [28]:
from sqlalchemy.exc import SQLAlchemyError
id=input("Enter student id :")
my_data = (id,)
q="UPDATE student SET mark=mark+5 WHERE id = ?"
try :
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)
else:
  print("No of record updated:", r_set.rowcount)

Enter student id :35
No of record updated: 1

In [29]:
from sqlalchemy.exc import SQLAlchemyError
my_data=('Six', 'Seven')
q="UPDATE student SET class=? WHERE class = ?"
try:
  r_set = my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else:
  print("No of records updated :",r_set.rowcount)

No of records updated : 4

In [30]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class) FROM student"
try:
  r_set = my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else:
  print("No of records updated :",r_set.rowcount)

Four
Five
Six
No of records updated : -1

In [33]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class) FROM student WHERE mark >=80"
try:
  r_set = my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e._dict_['orig'])
  print(error)
else:
  print("No of records updated :",r_set.rowcount)

Four
Five
Six
No of records updated : -1

In [20]:
from sqlalchemy.exc import SQLAlchemyError
try: 
  my_conn.execute(''' DROP table student;''')
  print( "student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

student table deleted